app/views/home/profil.html.erb

    <p class="lead text-center">
    Bonjour, <%= User.find(current_user.id).name.capitalize %> !
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

            <ul>
                <li><span>Prénom : </span><%= User.find(current_user.id).name.capitalize %></li>
                <li><span>Nom : </span><%= User.find(current_user.id).surname.capitalize %></li>
                <li><span>Email : </span><%= User.find(current_user.id).email %></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]