app/controllers/home_controller.rb

	def search2
		@plante_cherche = params[:plante].upcase

		if params[:plante] != nil && Plantae.find_by(Plante: @plante_cherche) != nil
			@id_plante_search = Plantae.find_by(Plante: @plante_cherche).id

			@tab_ecosystem_plante = Ecosystem.where(plantae_id2: @id_plante_search )
---
SELECT "ecosystems".* FROM "ecosystems" WHERE "ecosystems"."plantae_id2" = ?  [["plantae_id2", 66]]