app/controllers/home_controller.rb

	def search2
		@plante_cherche = params[:plante].upcase

		if params[:plante] != nil && Plantae.find_by(Plante: @plante_cherche) != nil
			@id_plante_search = Plantae.find_by(Plante: @plante_cherche).id

			@tab_association_plante = Association.where(plantae_id2: @id_plante_search )
---
SELECT  "plantaes".* FROM "plantaes" WHERE "plantaes"."Plante" = ? LIMIT ?  [["Plante", "TOMATE"], ["LIMIT", 1]]
SELECT "associations".* FROM "associations" WHERE "associations"."plantae_id2" = ?  [["plantae_id2", 66]]

	def profil
		if user_signed_in?
			@id_user = current_user.id
			@tab_don = Don.where(user_id: @id_user)
---
SELECT "dons".* FROM "dons" WHERE "dons"."user_id" = ?  [["user_id", 2]]